Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: بسم الله الرحمن الرحيم
en: In the Name of Allah, the Most Beneficent, the Most Merciful.

source: الحمد لله رب العالمين
en: All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).

source: الرحمن الرحيم
en: The Most Beneficent, the Most Merciful.

source: مالك يوم الدين
en: The Only Owner (and the Only Ruling Judge) of the Day of Recompense (i.e. the Day of Resurrection)

source: إياك نعبد وإياك نستعين
en: You (Alone) we worship, and you (Alone) we ask for help (for each and everything).

source: اهدنا الصراط المستقيم
en: Guide us to the Straight Way

source: صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين
en: The Way of those on whom You have bestowed Your Grace , not (the way) of those who earned Your Anger (such as the Jews), nor of those who went astray (such as the Christians).

source: الم
en: Alif-Lam-Mim. [These letters are one of the miracles of the Qur'an and none but Allah (Alone) knows their meanings.]

source: ذلك الكتاب لا ريب فيه هدى للمتقين
en: This is the Book (the Qur'an), whereof there is no doubt, a guidance to those who are Al-Muttaqun [the pious believers of Islamic Monotheism who fear Allah much (abstain from all kinds of sins and evil deeds which He has forbidden) and love Allah much (perform all kinds of good deeds which He has ordained)].

source: الذين يؤمنون بالغيب ويقيمون الصلاة ومما رزقناهم ينفقون
en: Who believe in the Ghaib and perform As-Salat (Iqamat-as-Salat), and spend out of what We have provided for them [i.e. give Zakat , spend on themselves, their parents, their children, their wives, etc., and also give charity to the poor and also in Allah's Cause - Jihad].

source: والذين يؤمنون بما أنزل إليك وما أنزل من قبلك وبالآخرة هم يوقنون
en: And who believe in (the Qur'an and the Sunnah ) which has been sent down (revealed) to you (O Muhammad صلى الله عليه وسلم) and in that which was sent down before you [the Taurat (Torah) and the Injeel (Gospel), etc.] and they believe with certainty in the Hereafter. (Resurrection, recompense of their good and bad deeds, Paradise and Hell).

source: أولئك على هدى من ربهم وأولئك هم المفلحون
en: They are on (true) guidance from their Lord, and they are the successful.

source: إن الذين كفروا سواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون
en: Verily, those who disbelieve, it is the same to them whether you (O Muhammad صلى الله عليه وسلم) warn them or do not warn them, they will not believe.

source: ختم الله على قلوبهم وعلى سمعهم وعلى أبصارهم غشاوة ولهم عذاب عظيم
en: Allah has set a seal on their hearts and on their hearing, (i.e. they are closed from accepting Allah's Guidance), and on their eyes there is a covering. Theirs will be a great torment.

source: ومن الناس من يقول آمنا بالله وباليوم الآخر وما هم بمؤمنين
en: And of mankind, there are some (hypocrites) who say: "We believe in Allah and the Last Day" while in fact they believe not.

source: يخادعون الله والذين آمنوا وما يخدعون إلا أنفسهم وما يشعرون
en: They (think to) deceive Allah and those who believe, while they only deceive themselves, and perceive (it) not!

source: في قلوبهم مرض فزادهم الله مرضا ولهم عذاب أليم بما كانوا يكذبون
en: In their hearts is a disease (of doubt and hypocrisy) and Allah has increased their disease. A painful torment is theirs because they used to tell lies.

source: وإذا قيل لهم لا تفسدوا في الأرض قالوا إنما نحن مصلحون
en: And when it is said to them: "Make not mischief on the earth," they say: "We are only peace-makers."

source: ألا إنهم هم المفسدون ولكن لا يشعرون
en: Verily! They are the ones who make mischief, but they perceive not.

source: وإذا قيل لهم آمنوا كما آمن الناس قالوا أنؤمن كما آمن السفهاء ألا إنهم هم السفهاء ولكن لا يعلمون
en: And when it is said to them (hypocrites): "Believe as the people (followers of Muhammad صلى الله عليه وسلم, Al-Ansar and Al-Muhajirun) have believed," they say: "Shall we believe as the fools have believed?" Verily, they are the fools, but they know not.

source: وإذا لقوا الذين آمنوا قالوا آمنا وإذا خلوا إلى شياطينهم قالوا إنا معكم إنما نحن مستهزئون
en: And when they meet those who believe, they say: "We believe," but when they are alone with their Shayatin (devils - polytheists, hypocrites), they say: "Truly, we are with you; verily, we were but mocking."

source: الله يستهزئ بهم ويمدهم في طغيانهم يعمهون
en: Allah mocks at them and gives them increase in their wrong-doing to wander blindly.

source: أولئك الذين اشتروا الضلالة بالهدى فما ربحت تجارتهم وما كانوا مهتدين
en: These are they who have purchased error for guidance, so their commerce was profitless. And they were not guided.

source: مثلهم كمثل الذي استوقد نارا فلما أضاءت ما حوله ذهب الله بنورهم وتركهم في ظلمات لا يبصرون
en: Their likeness is as the likeness of one who kindled a fire; then, when it lighted all around him, Allah took away their light and left them in darkness. (So) they could not see.

source: صم بكم عمي فهم لا يرجعون
en: They are deaf, dumb, and blind, so they return not (to the Right Path).

source: أو كصيب من السماء فيه ظلمات ورعد وبرق يجعلون أصابعهم في آذانهم من الصواعق حذر الموت والله محيط بالكافرين
en: Or like a rainstorm from the sky, wherein is darkness, thunder, and lightning. They thrust their fingers in their ears to keep out the stunning thunder-clap for fear of death. But Allah ever encompasses the disbelievers (i.e. Allah will gather them all together).

source: يكاد البرق يخطف أبصارهم كلما أضاء لهم مشوا فيه وإذا أظلم عليهم قاموا ولو شاء الله لذهب بسمعهم وأبصارهم إن الله على كل شيء قدير
en: The lightning almost snatches away their sight, whenever it flashes for them, they walk therein, and when darkness covers them, they stand still. And if Allah willed, He could have taken away their hearing and their sight. Certainly, Allah has power over all things.

source: يا أيها الناس اعبدوا ربكم الذي خلقكم والذين من قبلكم لعلكم تتقون
en: O mankind! Worship your Lord (Allah), Who created you and those who were before you so that you may become Al-Muttaqun (the pious - See V.2:2).

source: الذي جعل لكم الأرض فراشا والسماء بناء وأنزل من السماء ماء فأخرج به من الثمرات رزقا لكم فلا تجعلوا لله أندادا وأنتم تعلمون
en: Who has made the earth a resting place for you, and the sky as a canopy, and sent down water (rain) from the sky and brought forth therewith fruits as a provision for you. Then do not set up rivals unto Allah (in worship) while you know (that He Alone has the right to be worshipped).

source: وإن كنتم في ريب مما نزلنا على عبدنا فأتوا بسورة من مثله وادعوا شهداءكم من دون الله إن كنتم صادقين
en: And if you (Arab pagans, Jews, and Christians) are in doubt concerning that which We have sent down (i.e. the Qur'an) to Our slave (Muhammad صلى الله عليه وسلم), then produce a Surah (chapter) of the like thereof and call your witnesses (supporters and helpers) besides Allah, if you are truthful.

source: فإن لم تفعلوا ولن تفعلوا فاتقوا النار التي وقودها الناس والحجارة أعدت للكافرين
en: But if you do it not, and you can never do it, then fear the Fire (Hell) whose fuel is men and stones, prepared for the disbelievers.

source: وبشر الذين آمنوا وعملوا الصالحات أن لهم جنات تجري من تحتها الأنهار كلما رزقوا منها من ثمرة رزقا قالوا هذا الذي رزقنا من قبل وأتوا به متشابها ولهم فيها أزواج مطهرة وهم فيها خالدون
en: And give glad tidings to those who believe and do righteous good deeds, that for them will be Gardens under which rivers flow (Paradise). Every time they will be provided with a fruit therefrom, they will say: "This is what we were provided with before," and they will be given things in resemblance (i.e. in the same form but different in taste) and they shall have therein Azwajun Mutahharatun (purified mates or wives) and they will abide therein forever.

source: إن الله لا يستحيي أن يضرب مثلا ما بعوضة فما فوقها فأما الذين آمنوا فيعلمون أنه الحق من ربهم وأما الذين كفروا فيقولون ماذا أراد الله بهذا مثلا يضل به كثيرا ويهدي به كثيرا وما يضل به إلا الفاسقين
en: Verily, Allah is not ashamed to set forth a parable even of a mosquito or so much more when it is bigger (or less when it is smaller) than it. And as for those who believe, they know that it is the Truth from their Lord, but as for those who disbelieve, they say: "What did Allah intend by this parable?" By it He misleads many, and many He guides thereby. And He misleads thereby only those who are Al-Fasiqun (the rebellious, disobedient to Allah ).

source: الذين ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض أولئك هم الخاسرون
en: Those who break Allah's Covenant after ratifying it, and sever what Allah has ordered to be joined (as regards Allah's religion of Islamic Monotheism, and to practise its laws on the earth and also as regards keeping good relations with kith and kin ), and do mischief on earth, it is they who are the losers.

source: كيف تكفرون بالله وكنتم أمواتا فأحياكم ثم يميتكم ثم يحييكم ثم إليه ترجعون
en: How can you disbelieve in Allah? seeing that you were dead and He gave you life. Then He will give you death, then again will bring you to life (on the Day of Resurrection) and then unto Him you will return (See V.40:11)

source: هو الذي خلق لكم ما في الأرض جميعا ثم استوى إلى السماء فسواهن سبع سماوات وهو بكل شيء عليم
en: He it is Who created for you all that is on earth. Then He rose over (Istawa) towards the heaven and made them seven heavens and He is the All-Knower of everything.

source: وإذ قال ربك للملائكة إني جاعل في الأرض خليفة قالوا أتجعل فيها من يفسد فيها ويسفك الدماء ونحن نسبح بحمدك ونقدس لك قال إني أعلم ما لا تعلمون
en: And (remember) when your Lord said to the angels: "Verily, I am going to place (mankind) generations after generations on earth." They said: "Will You place therein those who will make mischief therein and shed blood, - while we glorify You with praises and thanks and sanctify You." He (Allah) said: "I know that which you do not know."

source: وعلم آدم الأسماء كلها ثم عرضهم على الملائكة فقال أنبئوني بأسماء هؤلاء إن كنتم صادقين
en: And He taught Adam all the names (of everything) , then He showed them to the angels and said, "Tell Me the names of these if you are truthful."

source: قالوا سبحانك لا علم لنا إلا ما علمتنا إنك أنت العليم الحكيم
en: They (angels) said: "Glory be to You, we have no knowledge except what you have taught us. Verily, it is You, the All-Knower, the All-Wise."

source: قال يا آدم أنبئهم بأسمائهم فلما أنبأهم بأسمائهم قال ألم أقل لكم إني أعلم غيب السماوات والأرض وأعلم ما تبدون وما كنتم تكتمون
en: He said: "O Adam! Inform them of their names," and when he had informed them of their names, He said: "Did I not tell you that I know the Ghaib (Unseen) in the heavens and the earth, and I know what you reveal and what you have been concealing?"

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس أبى واستكبر وكان من الكافرين
en: And (remember) when We said to the angels: "Prostrate yourselves before Adam.". And they prostrated except Iblis (Satan), he refused and was proud and was one of the disbelievers (disobedient to Allah).

source: وقلنا يا آدم اسكن أنت وزوجك الجنة وكلا منها رغدا حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظالمين
en: And We said: "O Adam! Dwell you and your wife in the Paradise and eat both of you freely with pleasure and delight, of things therein as wherever you will, but come not near this tree or you both will be of the Zalimun (wrong-doers)."

source: فأزلهما الشيطان عنها فأخرجهما مما كانا فيه وقلنا اهبطوا بعضكم لبعض عدو ولكم في الأرض مستقر ومتاع إلى حين
en: Then the Shaitan (Satan) made them slip therefrom (the Paradise), and got them out from that in which they were. We said: "Get you down, all, with enmity between yourselves. On earth will be a dwelling place for you and an enjoyment for a time."

source: فتلقى آدم من ربه كلمات فتاب عليه إنه هو التواب الرحيم
en: Then Adam received from his Lord Words. And his Lord pardoned him (accepted his repentance). Verily, He is the One Who forgives (accepts repentance), the Most Merciful.

source: قلنا اهبطوا منها جميعا فإما يأتينكم مني هدى فمن تبع هداي فلا خوف عليهم ولا هم يحزنون
en: We said: "Get down all of you from this place (the Paradise), then whenever there comes to you Guidance from Me, and whoever follows My Guidance, there shall be no fear on them, nor shall they grieve.

source: والذين كفروا وكذبوا بآياتنا أولئك أصحاب النار هم فيها خالدون
en: But those who disbelieve and belie Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) - such are the dwellers of the Fire. They shall abide therein forever.

source: يا بني إسرائيل اذكروا نعمتي التي أنعمت عليكم وأوفوا بعهدي أوف بعهدكم وإياي فارهبون
en: O Children of Israel! Remember My Favour which I bestowed upon you, and fulfil (your obligations to) My Covenant (with you) so that I fulfil (My Obligations to) your covenant (with Me), and fear none but Me.

source: وآمنوا بما أنزلت مصدقا لما معكم ولا تكونوا أول كافر به ولا تشتروا بآياتي ثمنا قليلا وإياي فاتقون
en: And believe in what I have sent down (this Qur'an), confirming that which is with you, [the Taurat (Torah) and the Injeel (Gospel)], and be not the first to disbelieve therein, and buy [get (تاخذ اجرا)] not with My Verses [the Taurat (Torah) and the Injeel (Gospel)] a small price (i.e. getting a small gain by selling My Verses), and fear Me and Me Alone. (Tafsir At-Tabari ).

source: ولا تلبسوا الحق بالباطل وتكتموا الحق وأنتم تعلمون
en: And mix not truth with falsehood, nor conceal the truth [i.e. Muhammad صلى الله عليه وسلم is Allah's Messenger and his qualities are written in your Scriptures, the Taurat (Torah) and the Injeel (Gospel)] while you know (the truth).

source: وأقيموا الصلاة وآتوا الزكاة واركعوا مع الراكعين
en: And perform As-Salat (Iqamat-as-Salat), and give Zakat and bow down (or submit yourselves with obedience to Allah) along with Ar-Raki'un .

source: أتأمرون الناس بالبر وتنسون أنفسكم وأنتم تتلون الكتاب أفلا تعقلون
en: Enjoin you Al-Birr (piety and righteousness and each and every act of obedience to Allah) on the people and you forget (to practise it) yourselves, while you recite the Scripture [the Taurat (Torah)]! Have you then no sense?

source: واستعينوا بالصبر والصلاة وإنها لكبيرة إلا على الخاشعين
en: And seek help in patience and As-Salat (the prayer) and truly it is extremely heavy and hard except for Al-Khashi'un [i.e. the true believers in Allah - those who obey Allah with full submission, fear much from His Punishment, and believe in His Promise (Paradise) and in His Warnings (Hell)].

source: الذين يظنون أنهم ملاقو ربهم وأنهم إليه راجعون
en: (They are those) who are certain that they are going to meet their Lord, and that unto Him they are going to return.

source: يا بني إسرائيل اذكروا نعمتي التي أنعمت عليكم وأني فضلتكم على العالمين
en: O Children of Israel! Remember My Favour which I bestowed upon you and that I preferred you to the 'Alamin [mankind and jinn (of your time period, in the past)].

source: واتقوا يوما لا تجزي نفس عن نفس شيئا ولا يقبل منها شفاعة ولا يؤخذ منها عدل ولا هم ينصرون
en: And fear a Day (of Judgement) when a person shall not avail another, nor will intercession be accepted from him nor will compensation be taken from him nor will they be helped.

source: وإذ نجيناكم من آل فرعون يسومونكم سوء العذاب يذبحون أبناءكم ويستحيون نساءكم وفي ذلكم بلاء من ربكم عظيم
en: And (remember) when We delivered you from Fir'aun's (Pharaoh) people, who were afflicting you with a horrible torment, killing your sons and sparing your women, and therein was a mighty trial from your Lord.

source: وإذ فرقنا بكم البحر فأنجيناكم وأغرقنا آل فرعون وأنتم تنظرون
en: And (remember) when We separated the sea for you and saved you and drowned Fir'aun's (Pharaoh) people while you were looking (at them, when the sea-water covered them).

source: وإذ واعدنا موسى أربعين ليلة ثم اتخذتم العجل من بعده وأنتم ظالمون
en: And (remember) when We appointed for Musa (Moses) forty nights, and (in his absence) you took the calf (for worship), and you were Zalimun (polytheists and wrong-doers).

source: ثم عفونا عنكم من بعد ذلك لعلكم تشكرون
en: Then after that We forgave you so that you might be grateful.

source: وإذ آتينا موسى الكتاب والفرقان لعلكم تهتدون
en: And (remember) when We gave Musa (Moses) the Scripture [the Taurat (Torah)] and the criterion (of right and wrong) so that you may be guided aright."

source: وإذ قال موسى لقومه يا قوم إنكم ظلمتم أنفسكم باتخاذكم العجل فتوبوا إلى بارئكم فاقتلوا أنفسكم ذلكم خير لكم عند بارئكم فتاب عليكم إنه هو التواب الرحيم
en: And (remember) when Musa (Moses) said to his people: "O my people! Verily, you have wronged yourselves by worshipping the calf. So turn in repentance to your Creator and kill yourselves (the innocent kill the wrongdoers among you), that will be better for you with your Creator." Then He accepted your repentance. Truly, He is the One Who accepts repentance, the Most Merciful.

source: وإذ قلتم يا موسى لن نؤمن لك حتى نرى الله جهرة فأخذتكم الصاعقة وأنتم تنظرون
en: And (remember) when you said: "O Musa (Moses)! We shall never believe in you until we see Allah plainly." But you were seized with a thunder-bolt (lightning) while you were looking.

source: ثم بعثناكم من بعد موتكم لعلكم تشكرون
en: Then We raised you up after your death, so that you might be grateful.

source: وظللنا عليكم الغمام وأنزلنا عليكم المن والسلوى كلوا من طيبات ما رزقناكم وما ظلمونا ولكن كانوا أنفسهم يظلمون
en: And We shaded you with clouds and sent down on you Al-Manna and the quails, (saying): "Eat of the good lawful things We have provided for you," (but they rebelled). And they did not wrong Us but they wronged themselves.

source: وإذ قلنا ادخلوا هذه القرية فكلوا منها حيث شئتم رغدا وادخلوا الباب سجدا وقولوا حطة نغفر لكم خطاياكم وسنزيد المحسنين
en: And (remember) when We said: "Enter this town (Jerusalem) and eat bountifully therein with pleasure and delight wherever you wish, and enter the gate in prostration (or bowing with humility) and say: 'Forgive us,' and We shall forgive you your sins and shall increase (reward) for the good-doers."

source: فبدل الذين ظلموا قولا غير الذي قيل لهم فأنزلنا على الذين ظلموا رجزا من السماء بما كانوا يفسقون
en: But those who did wrong changed the word from that which had been told to them for another, so We sent upon the wrong-doers Rijz (a punishment) from the heaven because of their rebelling against Allah's obedience. (Tafsir At-Tabari).

source: وإذ استسقى موسى لقومه فقلنا اضرب بعصاك الحجر فانفجرت منه اثنتا عشرة عينا قد علم كل أناس مشربهم كلوا واشربوا من رزق الله ولا تعثوا في الأرض مفسدين
en: And (remember) when Musa (Moses) asked for water for his people, We said: "Strike the stone with your stick." Then gushed forth therefrom twelve springs. Each (group of) people knew its own place for water. "Eat and drink of that which Allah has provided and do not act corruptly, making mischief on the earth."

source: وإذ قلتم يا موسى لن نصبر على طعام واحد فادع لنا ربك يخرج لنا مما تنبت الأرض من بقلها وقثائها وفومها وعدسها وبصلها قال أتستبدلون الذي هو أدنى بالذي هو خير اهبطوا مصرا فإن لكم ما سألتم وضربت عليهم الذلة والمسكنة وباءوا بغضب من الله ذلك بأنهم كانوا يكفرون بآيات الله ويقتلون النبيين بغير الحق ذلك بما عصوا وكانوا يعتدون
en: And (remember) when you said, "O Musa (Moses)! We cannot endure one kind of food. So invoke your Lord for us to bring forth for us of what the earth grows, its herbs, its cucumbers, its Fum (wheat or garlic), its lentils and its onions." He said, "Would you exchange that which is better for that which is lower? Go you down to any town and you shall find what you want!" And they were covered with humiliation and misery, and they drew on themselves the Wrath of Allah. That was because they used to disbelieve the Ayat (proofs, evidence, verses, lessons, signs, revelations etc.) of Allah and killed the Prophets wrongfully. That was because they disobeyed and used to transgress the bounds (in their disobedience to Allah, i.e. commit crimes and sins).

source: إن الذين آمنوا والذين هادوا والنصارى والصابئين من آمن بالله واليوم الآخر وعمل صالحا فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون
en: Verily! Those who believe and those who are Jews and Christians, and Sabians, whoever believes in Allah and the Last Day and does righteous good deeds shall have their reward with their Lord, on them shall be no fear, nor shall they grieve.

source: وإذ أخذنا ميثاقكم ورفعنا فوقكم الطور خذوا ما آتيناكم بقوة واذكروا ما فيه لعلكم تتقون
en: And (O Children of Israel, remember) when We took your covenant and We raised above you the Mount (saying): "Hold fast to that which We have given you, and remember that which is therein so that you may become Al-Muttaqun (the pious - See V.2:2).

source: ثم توليتم من بعد ذلك فلولا فضل الله عليكم ورحمته لكنتم من الخاسرين
en: Then after that you turned away. Had it not been for the Grace and Mercy of Allah upon you, indeed you would have been among the losers.

source: ولقد علمتم الذين اعتدوا منكم في السبت فقلنا لهم كونوا قردة خاسئين
en: And indeed you knew those amongst you who transgressed in the matter of the Sabbath (i.e. Saturday). We said to them: "Be you monkeys, despised and rejected."

source: فجعلناها نكالا لما بين يديها وما خلفها وموعظة للمتقين
en: So We made this punishment an example to their own and to succeeding generations and a lesson to those who are Al-Muttaqun (the pious - See V.2:2).

source: وإذ قال موسى لقومه إن الله يأمركم أن تذبحوا بقرة قالوا أتتخذنا هزوا قال أعوذ بالله أن أكون من الجاهلين
en: And (remember) when Musa (Moses) said to his people: "Verily, Allah commands you that you slaughter a cow." They said, "Do you make fun of us?" He said, "I take Allah's Refuge from being among Al-Jahilun (the ignorant or the foolish)."

source: قالوا ادع لنا ربك يبين لنا ما هي قال إنه يقول إنها بقرة لا فارض ولا بكر عوان بين ذلك فافعلوا ما تؤمرون
en: They said, "Call upon your Lord for us that He may make plain to us what it is!" He said, "He says, 'Verily, it is a cow neither too old nor too young, but (it is) between the two conditions', so do what you are commanded."

source: قالوا ادع لنا ربك يبين لنا ما لونها قال إنه يقول إنها بقرة صفراء فاقع لونها تسر الناظرين
en: They said, "Call upon your Lord for us to make plain to us its colour." He said, "He says, 'It is a yellow cow, bright in its colour, pleasing to the beholders.' "

source: قالوا ادع لنا ربك يبين لنا ما هي إن البقر تشابه علينا وإنا إن شاء الله لمهتدون
en: They said, "Call upon your Lord for us to make plain to us what it is. Verily, to us all cows are alike. And surely, if Allah wills, we will be guided."

source: قال إنه يقول إنها بقرة لا ذلول تثير الأرض ولا تسقي الحرث مسلمة لا شية فيها قالوا الآن جئت بالحق فذبحوها وما كادوا يفعلون
en: He [Musa (Moses)] said, "He says, 'It is a cow neither trained to till the soil nor water the fields, sound, having no other colour except bright yellow.' " They said, "Now you have brought the truth." So they slaughtered it though they were near to not doing it.

source: وإذ قتلتم نفسا فادارأتم فيها والله مخرج ما كنتم تكتمون
en: And (remember) when you killed a man and fell into dispute among yourselves as to the crime. But Allah brought forth that which you were hiding.

source: فقلنا اضربوه ببعضها كذلك يحيي الله الموتى ويريكم آياته لعلكم تعقلون
en: So We said: "Strike him (the dead man) with a piece of it (the cow)." Thus Allah brings the dead to life and shows you His Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) so that you may understand.
